Autodesk.Revit.DB.IPrintSetting.PrintParameters
Returns the Parameters of Print Setup.
Remarks: The Parameters of Print Setup. Refer to the Print Setup dialog in Revit for details.

Autodesk.Revit.DB.IPrintSetting
An interface which represents the Print Setup (Application Menu->Print->Print Setup) within Autodesk Revit.